// Запитати користувача про розмір зарплати
const salary = parseFloat(prompt('Введіть розмір вашої зарплати:'));

// Надбавка у вигляді премії в сумі 15% від його зарплати 
const premium = 0.15 * salary;

// Податки в сумі 10% від суми всіх нарахувань (зарплата + премія)
const taxes = 0.10 * (salary + premium);

// Витрати в магазині
let costs = 190;

// Розрахунок залишку від зарплати після врахування усіх витрат та нарахувань
let remainder = salary + premium - taxes - costs;

// Вивести залишок через alert
alert('Ваш залишок від зарплати: ' + remainder.toFixed(2));